персонаж(тирион, мужчина).
персонаж(тирион, карлик).
персонаж(тирион, невысокий).
персонаж(тирион, любит_проституток).
персонаж(тирион, мастер_над_монетой).
персонаж(тирион, пересекал_великое_море).
персонаж(тирион, десница_короля).
персонаж(тирион, хитрый).
персонаж(тирион, шрам_на_лице).
персонаж(тирион, светлые_волосы).
персонаж(тирион, средних_лет).
персонаж(тирион, алкоголизм).
персонаж(тирион, был_на_стене).
персонаж(тирион, хороший_любовник).


персонаж(серсея, женщина).
персонаж(серсея, королева).
персонаж(серсея, претендует_на_трон).
персонаж(серсея, светлые_волосы).
персонаж(серсея, хитрый).
персонаж(серсея, средних_лет).
персонаж(серсея, высокий).
персонаж(серсея, алкоголизм).

персонаж(джейме, без_руки).
персонаж(джейме, золотая_рука).
персонаж(джейме, глава_золотых_плащей).
персонаж(джейме, мужчина).
персонаж(джейме, светлые_волосы).
персонаж(джейме, главнокомандующий).
персонаж(джейме, средних_лет).
персонаж(джейме, высокий).
персонаж(джейме, хороший_любовник).


персонаж(тайвин, плохой_отец).
персонаж(тайвин, мужчина).
персонаж(тайвин, десница_короля).
персонаж(тайвин, умный).
персонаж(тайвин, умер_на_унитазе).
персонаж(тайвин, мёртв).
персонаж(тайвин, старый).
персонаж(тайвин, светлые_волосы).
персонаж(тайвин, высокий).

персонаж(джоффри, мужчина).
персонаж(джоффри, юный).
персонаж(джоффри, мёртв).
персонаж(джоффри, король).
персонаж(джоффри, светлые_волосы).
персонаж(джоффри, невысокий).

персонаж(нэд, десница_короля).
персонаж(нэд, мужчина).
персонаж(нэд, хранитель_севера).
персонаж(нэд, глава_винтерфелла).
персонаж(нэд, мёртв).
персонаж(нэд, средних_лет).
персонаж(нэд, темные_волосы).
персонаж(нэд, высокий).
персонаж(нэд, был_на_стене).

персонаж(роб, не_сдержал_обещание).
персонаж(роб, мужчина).
персонаж(роб, хранитель_севера).
персонаж(роб, глава_винтерфелла).
персонаж(роб, мёртв).
персонаж(роб, юный).
персонаж(роб, темные_волосы).

персонаж(джон, мужчина).
персонаж(джон, бастард).
персонаж(джон, ночной_дозор).
персонаж(джон, летал_на_драконах).
персонаж(джон, глава_винтерфелла).
персонаж(джон, главнокомандующий).
персонаж(джон, лорд_командующий). 
персонаж(джон, юный).
персонаж(джон, темные_волосы).
персонаж(джон, бастард).
персонаж(джон, был_на_стене).
персонаж(джон, хороший_любовник).


персонаж(арья, женщина).
персонаж(арья, любит_печь_пироги).
персонаж(арья, дерзкий).
персонаж(арья, благородство).
персонаж(арья, пересекал_великое_море).
персонаж(арья, юный).
персонаж(арья, темные_волосы).
персонаж(арья, невысокий).

персонаж(санса, женщина).
персонаж(санса, принцесса).
персонаж(санса, глава_винтерфелла).
персонаж(санса, рыжие_волосы).
персонаж(санса, неудачное_замужество_2_раза).

персонаж(дейнерис, летал_на_драконах).
персонаж(дейнерис, претендует_на_трон).
персонаж(дейнерис, пересекал_великое_море).
персонаж(дейнерис, женщина).
персонаж(дейнерис, кхалиси).
персонаж(дейнерис, светлые_волосы).
персонаж(дейнерис, был_на_стене).
персонаж(дейнерис, юный).
персонаж(дейнерис, дерзкий).
персонаж(дейнерис, хороший_любовник).


персонаж(бриена, женщина).
персонаж(бриена, рыцарь).
персонаж(бриена, благородство).
персонаж(бриена, средних_лет).
персонаж(бриена, светлые_волосы).
персонаж(бриена, высокий).

персонаж(сэмвел, мужчина).
персонаж(сэмвел, убил_белого_ходока).
персонаж(сэмвел, мейстер).
персонаж(сэмвел, был_на_стене).
персонаж(сэмвел, юный).
персонаж(сэмвел, темные_волосы).
персонаж(сэмвел, толстый).


персонаж(гора, мужчина).
персонаж(гора, мёртв).
персонаж(гора, сила).
персонаж(гора, машина_убийства).
персонаж(гора, средних_лет).
персонаж(гора, темные_волосы).
персонаж(гора, высокий).

персонаж(пёс, мужчина).
персонаж(пёс, боится_огня).
персонаж(пёс, шрам_на_лице).
персонаж(пёс, мог_бы_участвовать_в_олимпийских_играх).
персонаж(пёс, был_на_стене).
персонаж(пёс, средних_лет).
персонаж(пёс, темные_волосы).

персонаж(джендри, мужчина).
персонаж(джендри, бастард).
персонаж(джендри, кузнец).
персонаж(джендри, мог_бы_участвовать_в_олимпийских_играх).
персонаж(джендри, был_на_стене).
персонаж(джендри, юный).
персонаж(джендри, темные_волосы).
персонаж(джендри, бастард).

персонаж(мизинец, мужчина).
персонаж(мизинец, владеет_публичным_домом).
персонаж(мизинец, хитрый).
персонаж(мизинец, мастер_над_монетой).
персонаж(мизинец, мёртв).
персонаж(мизинец, слишком_много_врёт).
персонаж(мизинец, средних_лет).
персонаж(мизинец, темные_волосы).

персонаж(брон, мужчина).
персонаж(брон, наемник).
персонаж(брон, ранил_дракона).
персонаж(брон, хочет_замок).
персонаж(брон, средних_лет).
персонаж(брон, дерзкий).
персонаж(брон, темные_волосы).
персонаж(брон, алкоголизм).


персонаж(подрик, мужчина).
персонаж(подрик, любит_проституток).
персонаж(подрик, хорошо_удовлетворяет_женщин).
персонаж(подрик, оруженосец).
персонаж(подрик, хороший_друг).
персонаж(подрик, юный).
персонаж(подрик, темные_волосы).

персонаж(король_ночи, мужчина).
персонаж(король_ночи, хочет_замок).
персонаж(король_ночи, ранил_дракона).
персонаж(король_ночи, мог_бы_участвовать_в_олимпийских_играх).
персонаж(король_ночи, мёртв).
персонаж(король_ночи, был_на_стене).
персонаж(король_ночи, старый).
персонаж(король_ночи, лысый).
персонаж(король_ночи, высокий).

персонаж(шая, женщина).
персонаж(шая, проститутка).
персонаж(шая, мёртв).
персонаж(шая, темные_волосы).
персонаж(шая, пересекал_великое_море).
персонаж(шая, юный).
персонаж(шая, хороший_любовник).


персонаж(дрого, мужчина).
персонаж(дрого, коса).
персонаж(дрого, убил_таргариена).
персонаж(дрого, дотракиец).
персонаж(дрого, сильный).
персонаж(дрого, эссос).
персонаж(дрого, мёртв).
персонаж(дрого, средних_лет).
персонаж(дрого, темные_волосы).
персонаж(дрого, высокий).

персонаж(мелисандра, женщина).
персонаж(мелисандра, красный_владыка).
персонаж(мелисандра, пересекал_великое_море).
персонаж(мелисандра, старый).
персонаж(мелисандра, рыжие_волосы).
персонаж(мелисандра, был_на_стене).
персонаж(мелисандра, хороший_любовник).


персонаж(варис, евнух).
персонаж(варис, хитрый).
персонаж(варис, мужчина).
персонаж(варис, лысый).
персонаж(варис, пересекал_великое_море).
персонаж(варис, средних_лет).
персонаж(варис, толстый).

персонаж(русе, мужчина).
персонаж(русе, хранитель_севера).
персонаж(русе, глава_винтерфелла).
персонаж(русе, подлый).
персонаж(русе, мёртв).
персонаж(русе, старый).
персонаж(русе, темные_волосы).
персонаж(русе, высокий).

персонаж(яра, женщина).
персонаж(яра, лесбиянка).
персонаж(яра, железнорожденный).
персонаж(яра, плененный).
персонаж(яра, моряк).
персонаж(яра, пересекал_великое_море).
персонаж(яра, юный).
персонаж(яра, тёмные_волосы).

персонаж(теон, мужчина).
персонаж(теон, евнух).
персонаж(теон, предатель).
персонаж(теон, тряпка).
персонаж(теон, глава_винтерфелла).
персонаж(теон, юный).
персонаж(теон, темные_волосы).

персонаж(эурон, мужчина).
персонаж(эурон, хочет_замок).
персонаж(эурон, моряк).
персонаж(эурон, хитрый).
персонаж(эурон, подлый).
персонаж(эурон, сильный).
персонаж(эурон, пересекал_великое_море).
персонаж(эурон, дерзкий).
персонаж(эурон, средних_лет).
персонаж(эурон, тёмные_волосы).
персонаж(эурон, алкоголизм).
персонаж(эурон, хороший_любовник).



персонаж(бран, мужчина).
персонаж(бран, калека).
персонаж(бран, умеет_хранить_секреты).
персонаж(бран, может_произвести_тест_на_отцовство).
персонаж(бран, был_на_стене).
персонаж(бран, юный).
персонаж(бран, темные_волосы).

персонаж(игритт, женщина).
персонаж(игритт, одичалый).
персонаж(игритт, рыжие_волосы).
персонаж(игритт, хороший_любовник).
персонаж(игритт, мёртв).
персонаж(игритт, был_на_стене).
персонаж(игритт, юный).
персонаж(игритт, высокий).
персонаж(игритт, хороший_любовник).


персонаж(джорах, мужчина).
персонаж(джорах, серая_хворь).
персонаж(джорах, предатель).
персонаж(джорах, был_на_стене).
персонаж(джорах, старый).
персонаж(джорах, темные_волосы).
персонаж(джорах, высокий).

персонаж(серый_червь, мужчина).
персонаж(серый_червь, евнух).
персонаж(серый_червь, наемник).
персонаж(серый_червь, лысый).
персонаж(серый_червь, главнокомандующий).
персонаж(серый_червь, пересекал_великое_море).
персонаж(серый_червь, юный).

персонаж(рамси, мужчина).
персонаж(рамси, бастард).
персонаж(рамси, псих).
персонаж(рамси, главнокомандующий).
персонаж(рамси, мёртв).
персонаж(рамси, дерзкий).
персонаж(рамси, юный).
персонаж(рамси, темные_волосы).
персонаж(рамси, бастард).


персонаж(ходор, мужчина).
персонаж(ходор, ходор).
персонаж(ходор, великан).
персонаж(ходор, тягач).
персонаж(ходор, добрый).
персонаж(ходор, был_на_стене).
персонаж(ходор, мёртв).
персонаж(ходор, старый).
персонаж(ходор, толстый).
персонаж(ходор, светлые_волосы).

персонаж(оберин, мужчина).
персонаж(оберин, мёртв).
персонаж(оберин, поединок).
персонаж(оберин, бисексуал).
персонаж(оберин, любит_проституток).
персонаж(оберин, слишком_много_болтает).
персонаж(оберин, средних_лет).
персонаж(оберин, высокий).
персонаж(оберин, темные_волосы).
персонаж(оберин, хороший_любовник).


персонаж(лорас, мужчина).
персонаж(лорас, гей).
персонаж(лорас, мёртв).
персонаж(лорас, юный).
персонаж(лорас, чувственный).
персонаж(лорас, темные_волосы).
персонаж(лорас, хороший_любовник).


персонаж(маргери, женщина).
персонаж(маргери, мёртв).
персонаж(маргери, красота).
персонаж(маргери, хитрый).
персонаж(маргери, брюнетка).
персонаж(маргери, неудачное_замужество_2_раза).
персонаж(маргери, юный).
персонаж(маргери, светлые_волосы).
персонаж(маргери, хороший_любовник).


персонаж(элия, женщина).
персонаж(элия, мертв).
персонаж(элия, юный).
персонаж(элия, хороший_любовник).


персонаж(эйрис, мужчина).
персонаж(эйрис, мертв).
персонаж(эйрис, безумный_король).
персонаж(эйрис, дедушка_джона).
персонаж(эйрис, старый).
персонаж(эйрис, светлые_волосы).

персонаж(лиана, женщина).
персонаж(лиана, мертв).
персонаж(лиана, синяя_лилия).
персонаж(лиана, лед).
персонаж(лиана, юный).
персонаж(лиана, темные_волосы).

персонаж(роберт, мужчина).
персонаж(роберт, средних_лет).
персонаж(роберт, толстый).
персонаж(роберт, мертв).
персонаж(роберт, победиль_гражданской_войны).
персонаж(роберт, темные_волосы).
персонаж(роберт, любит_проституток).
персонаж(роберт, алкоголизм).

% советник(у кого, кто).
советник(дейнерис, тирион).
советник(дейнерис, варис).
советник(джоффри, варис).
советник(джоффри, мизинец).
советник(джоффри, тирион).

семья(таргарены, _ , эйрис , [дейнерис, визерис, рейгар]).
семья(таргарены, элия , рейгар , [рейнис, эйгон]).
семья(таргарены, лиана , рейгар , [джон]).
семья(ланнистеры, _, тайвин, [джейме, серсея, тирион]).
семья(старки, кейтилин, нэд, [роб, джон, санса, арья, бран, рикон]).
семья(баратеон, серсея, роберт, [джоффри, мирцелла, томмен, джендри]).
семья(болтон, _, русе, [рамси]).
семья(грейджои, _, _, [яра, теон, эурон]).
семья(тарт, _, _, [бриена]).
семья(тарли, _, _, [сэмвел]).
семья(тирелл, оленна, _, [лорас, маргерри ]).
семья(мартелл, _, _, [оберин, элия]).

семья_факт(ланнистеры, платят_долги).

оружие(джейме, меч).
оружие(тайвин, меч).
оружие(нэд, меч).
оружие(арья, меч).
оружие(пёс, меч).
оружие(гора, меч).
оружие(бриена, меч).
оружие(роб, меч).
оружие(джон, меч).
оружие(кхал, аракх).
оружие(король_ночи, копьё).
оружие(мелисандра, магия).
оружие(бран, магия).
оружие(теон, меч).
оружие(рамси, псы).
оружие(рамси, меч).
оружие(рамси, лук).
оружие(оберин, яд).
оружие(роберт, молот).

место_обитания(тирион, королевская_гавань).
место_обитания(тирион, драконий_камень).
место_обитания(тирион, утес_кастерли).
место_обитания(серсея, королевская_гавань).
место_обитания(серсея, утес_кастерли).
место_обитания(джейме, королевская_гавань).
место_обитания(джейме, утес_кастерли).
место_обитания(джоффри, королевская_гавань).
место_обитания(тайвин, королевская_гавань).
место_обитания(тайвин, утес_кастерли).
место_обитания(нэд, королевская_гавань).
место_обитания(нэд, винтерфелл).
место_обитания(роб, винтерфелл).
место_обитания(джон, винтерфелл).
место_обитания(джон, стена).
место_обитания(арья, браавос).
место_обитания(арья, винтерфелл).
место_обитания(арья, королевская_гавань).
место_обитания(санса, винтерфелл).
место_обитания(санса, королевская_гавань).
место_обитания(дейнерис, драконий_камень).
место_обитания(дейнерис, ваес_дотрак).
место_обитания(варис, драконий_камень).
место_обитания(варис, королевская_гавань).
место_обитания(гора, королевская_гавань).
место_обитания(пёс, королевская_гавань).
место_обитания(бриена, штормовые_земли).
место_обитания(джендри, королевская_гавань).
место_обитания(мизинец, королевская_гавань). 
место_обитания(король_ночи, крайний_север).
место_обитания(шая, лорат).
место_обитания(дрого, ваес_дотрак).
место_обитания(мелисандра, асшай).

% --- правила ---
 
% Элемент входит в список, если 
входит(X, [X | _ ]). % он является его головой, 
входит(X, [ _ | Список]) :-	входит(X, Список). % либо входит в хвост списка

% объединить(список1, список2, результат)
объединить([], L, L).
объединить([X | L1], L2, [X | L]) :- % первым элементом объединения является
                                     % первый элемент первого списка
объединить(L1, L2, L). % объединить хвост первого списка со вторым списком

удаление_дубликатов([], []) :- !.
удаление_дубликатов([H1|T1], Res) :- входит(H1, T1), !, удаление_дубликатов(T1, Res).
удаление_дубликатов([H1|T1], [H1|T2]) :- удаление_дубликатов(T1, T2).

получение_фактов_персонажи(Результат, Длина) :- findall(Факт, персонаж(_, Факт), Список2), удаление_дубликатов(Список2, Результат), length(Результат, Длина).
получение_фактов_оружие(Результат, Длина) :- findall(Факт, оружие(_, Факт), Список2), удаление_дубликатов(Список2, Результат), length(Результат, Длина).
получение_фактов_место_обитания(Результат, Длина) :- findall(Факт, место_обитания(_, Факт), Список2), удаление_дубликатов(Список2, Результат), length(Результат, Длина).
получение_фактов_советники(Результат, Длина) :- findall(Имя, советник(_, Имя), Список2),  удаление_дубликатов(Список2, Результат), length(Результат, Длина).

печать([], _).
печать([Голова|Хвост], Индекс) :- write(Индекс), write('. '),
								  write(Голова), write('\n'), 
								  Индекс2 is Индекс + 1, печать(Хвост, Индекс2).
											 											 

факты_персонажы(Индекс) :- получение_фактов_персонажи(Список, _), печать(Список, Индекс).
факты_оружие(Индекс) :- получение_фактов_оружие(Список, _), печать(Список, Индекс).
факты_место_обитания(Индекс) :- получение_фактов_место_обитания(Список, _), печать(Список, Индекс).
факты_советники(Индекс) :- получение_фактов_советники(Список, _), печать(Список, Индекс).


общий_список(Результат) :- получение_фактов_персонажи(Список, _),
						получение_фактов_оружие(Список2, _),
						получение_фактов_место_обитания(Список3, _),
						получение_фактов_советники(Список4, _),
						объединить(Список, Список2, С1),
						объединить(Список3, Список4, С2),
						объединить(С1, С2, Результат).						
						
все_факты :- получение_фактов_персонажи(Список, Длина), печать(Список, 1), 
			 получение_фактов_оружие(Список2, Длина2), L is (Длина + 1), печать(Список2, L),
			 получение_фактов_место_обитания(Список3, Длина3), L2 is (L + Длина2), печать(Список3, L2),
			 получение_фактов_советники(Список4, _), L3 is (L2 + Длина3), write('Являются советниками : \n'), печать(Список4, L3).

			 
поиск([], _, _) :- write('Нет такого индекса'), !.
поиск([H|_], Индекс, H) :- (Индекс =:= 1), !.  
поиск([_|T], Индекс, Результат) :- Индекс2 is (Индекс - 1), поиск(T, Индекс2, Результат).  


поиск_по_индексу(Индекс, Результат) :- общий_список(Список), поиск(Список, Индекс, Результат).

main([Голова | Хвост], Рез) :- поиск_по_индексу(Голова, Факт), 
							findall(Персонажи, советник(Персонажи, Факт), Список1),
							findall(Персонажи, персонаж(Персонажи, Факт), Список2),
							findall(Персонажи, оружие(Персонажи, Факт), Список3),
							findall(Персонажи, место_обитания(Персонажи, Факт), Список4),
							объединить(Список1, Список2, Р1), объединить(Список3, Список4, Р2),
							объединить(Р1, Р2, Р3), удаление_дубликатов(Р3, Рез).  
