персонаж(тирион, мужчина).
персонаж(тирион, карлик).
персонаж(тирион, любит_проституток).
персонаж(тирион, мастер_над_монетой).
персонаж(тирион, пересекал_великое_море).
персонаж(тирион, десница_короля).
персонаж(тирион, хитрый).
персонаж(тирион, шрам_на_лице).

персонаж(серсея, женщина).
персонаж(серсея, королева).
персонаж(серсея, претендует_на_трон).
персонаж(серсея, блондинка).
персонаж(серсея, хитрый).

персонаж(джейме, без_руки).
персонаж(джейме, золотая_рука).
персонаж(джейме, глава_золотых_плащей).
персонаж(джейме, мужчина).
персонаж(джейме, блондин).
персонаж(джейме, главнокомандующий).

персонаж(тайвин, плохой_отец).
персонаж(тайвин, мужчина).
персонаж(тайвин, десница_короля).
персонаж(тайвин, умный).
персонаж(тайвин, умер_на_унитазе).
персонаж(тайвин, мёртв).

персонаж(нэд, десница_короля).
персонаж(нэд, мужчина).
персонаж(нэд, хранитель_севера).
персонаж(нэд, глава_винтерфелла).
персонаж(нэд, мёртв).

персонаж(роб, не_сдержал_обещание).
персонаж(роб, мужчина).
персонаж(роб, хранитель_севера).
персонаж(роб, глава_винтерфелла).
персонаж(роб, мёртв).

персонаж(джон, мужчина).
персонаж(джон, бастард).
персонаж(джон, ночной_дозор).
персонаж(джон, летал_на_драконах).
персонаж(джон, глава_винтерфелла).
персонаж(джон, главнокомандующий).
персонаж(джон, бывал_за_стеной).

персонаж(арья, женщина).
персонаж(арья, любит_печь_пироги).
персонаж(арья, дерзкая).
персонаж(арья, благородство).
персонаж(арья, пересекал_великое_море).

персонаж(санса, женщина).
персонаж(санса, принцесса).
персонаж(санса, глава_винтерфелла).
персонаж(санса, рыжая).
персонаж(санса, неудачное_замужество_2_раза).

персонаж(дейнерис, летал_на_драконах).
персонаж(дейнерис, претендует_на_трон).
персонаж(дейнерис, пересекал_великое_море).
персонаж(дейнерис, женщина).
персонаж(дейнерис, кхалиси).
персонаж(дейнерис, блондинка).
персонаж(дейнерис, бывал_за_стеной).

персонаж(бриена, женщина).
персонаж(бриена, рыцарь).
персонаж(бриена, благородство).

персонаж(сэмвел, мужчина).
персонаж(сэмвел, убил_белого_ходака).
персонаж(сэмвел, мейстер).
персонаж(сэмвел, бывал_за_стеной).

персонаж(гора, мужчина).
персонаж(гора, мёртв).
персонаж(гора, сила).
персонаж(гора, машина_убийства).

персонаж(пёс, мужчина).
персонаж(пёс, боится_огня).
персонаж(пёс, шрам_на_лице).
персонаж(пёс, мог_бы_участвовать_в_олимпийских_играх).
персонаж(пёс, бывал_за_стеной).

персонаж(джендри, мужчина).
персонаж(джендри, бастард).
персонаж(джендри, кузнец).
персонаж(джендри, мог_бы_участвовать_в_олимпийских_играх).
персонаж(джендри, бывал_за_стеной).

персонаж(мизинец, мужчина).
персонаж(мизинец, владеет_публичным_домом).
персонаж(мизинец, хитрый).
персонаж(мизинец, мастер_над_монетой).
персонаж(мизинец, мёртв).
персонаж(мизинец, слишком_много_врёт).

персонаж(брон, мужчина).
персонаж(брон, наемник).
персонаж(брон, ранил_дракона).
персонаж(брон, хочет_замок).

персонаж(подрик, мужчина).
персонаж(подрик, любит_проституток).
персонаж(подрик, хорошо_удовлетворяет_женщин).
персонаж(подрик, оруженосец).
персонаж(подрик, брюнет).
персонаж(подрик, хороший_друг).

персонаж(король_ночи, мужчина).
персонаж(король_ночи, хочет_замок).
персонаж(король_ночи, ранил_дракона).
персонаж(король_ночи, мог_бы_участвовать_в_олимпийских_играх).
персонаж(король_ночи, мёртв).
персонаж(король_ночи, бывал_за_стеной).

персонаж(шая, женщина).
персонаж(шая, проститутка).
персонаж(шая, мёртв).
персонаж(шая, брюнетка).
персонаж(шая, пересекал_великое_море).

персонаж(дрого, мужчина).
персонаж(дрого, коса).
персонаж(дрого, убил_таргариена).
персонаж(дрого, дотракиец).
персонаж(дрого, сильный).
персонаж(дрого, эссос).
персонаж(дрого, мёртв).

персонаж(мелисандра, женщина).
персонаж(мелисандра, эссос).
персонаж(мелисандра, красный_владыка).
персонаж(мелисандра, старуха).
персонаж(мелисандра, пересекал_великое_море).

персонаж(варис, евнух).
персонаж(варис, хитрый).
персонаж(варис, мужчина).
персонаж(варис, лысый).
персонаж(варис, пересекал_великое_море).

персонаж(русе, мужчина).
персонаж(русе, хранитель_севера).
персонаж(русе, глава_винтерфелла).
персонаж(русе, подлый).
персонаж(русе, мёртв).

персонаж(яра, женщина).
персонаж(яра, лесбиянка).
персонаж(яра, железнорожденная).
персонаж(яра, плененная).
персонаж(яра, моряк).
персонаж(яра, пересекал_великое_море).

персонаж(теон, мужчина).
персонаж(теон, евнух).
персонаж(теон, предатель).
персонаж(теон, тряпка).
персонаж(теон, глава_винтерфелла).

персонаж(эурон, мужчина).
персонаж(эурон, хочет_замок).
персонаж(эурон, моряк).
персонаж(эурон, хитрый).
персонаж(эурон, подлый).
персонаж(эурон, сильный).
персонаж(эурон, пересекал_великое_море).

персонаж(бран, мужчина).
персонаж(бран, калека).
персонаж(бран, умеет_хранить_секреты).
персонаж(бран, может_произвести_тест_на_отцовство).
персонаж(бран, бывал_за_стеной).

персонаж(игритт, женщина).
персонаж(игритт, одичалая).
персонаж(игритт, рыжая).
персонаж(игритт, хорошая_любовница).
персонаж(игритт, мёртв).
персонаж(игритт, бывал_за_стеной).

персонаж(джорах, мужчина).
персонаж(джорах, серая_хворь).
персонаж(джорах, предатель).
персонаж(джорах, старый).
персонаж(джорах, бывал_за_стеной).

персонаж(серый_червь, мужчина).
персонаж(серый_червь, евнух).
персонаж(серый_червь, наемник).
персонаж(серый_червь, лысый).
персонаж(серый_червь, главнокомандующий).
персонаж(серый_червь, пересекал_великое_море).

персонаж(рамси, мужчина).
персонаж(рамси, бастард).
персонаж(рамси, псих).
персонаж(рамси, главнокомандующий).
персонаж(рамси, мёртв).

персонаж(ходор, мужчина).
персонаж(ходор, ходор).
персонаж(ходор, великан).
персонаж(ходор, тягач).
персонаж(ходор, добрый).
персонаж(ходор, бывал_за_стеной).
персонаж(ходор, мёртв).

персонаж(оберин, мужчина).
персонаж(оберин, мёртв).
персонаж(оберин, поединок).
персонаж(оберин, бисексуал).
персонаж(оберин, любит_проституток).
персонаж(оберин, слишком_много_болтает).

персонаж(лорас, мужчина).
персонаж(лорас, гей).
персонаж(лорас, мёртв).
персонаж(лорас, чувственный).

персонаж(маргери, женищна).
персонаж(маргери, мёртв).
персонаж(маргери, красота).
персонаж(маргери, хитрый).
персонаж(маргери, брюнетка).
персонаж(маргери, неудачное_замужество_2_раза).

персонаж(элия, женищна).
персонаж(элия, мертв).
персонаж(элия, первая_жена_рейгара).

персонаж(эйрис, мужчина).
персонаж(эйрис, мертв).
персонаж(эйрис, безумный_король).
персонаж(эйрис, дедушка_джона).

персонаж(лиана, женщина).
персонаж(лиана, мертв).
персонаж(лиана, синяя_лилия).
персонаж(лиана, лед).

% советник(у кого, кто).
советник(дейнерис, тирион).
советник(дейнерис, варис).
советник(джоффри, варис).
советник(джоффри, мизинец).
советник(джоффри, тирион).

семья(таргарены, _ , эйрис , [дейнерис, визерис, рейгар]).
семья(таргарены, элия , рейгар , [рейнис, эйгон]).
семья(таргарены, лиана , рейгар , [джон]).
семья(ланнистеры, _, тайвин, [джейме, серсея, тирион]).
семья(старки, кейтилин, нэд, [роб, джон, санса, арья, бран, рикон]).
семья(баратеон, серсея, роберт, [джоффри, мирцелла, томмен, джендри]).
семья(болтон, _, русе, [рамси]).
семья(грейджои, _, _, [яра, теон, эурон]).
семья(тарт, _, _, [бриена]).
семья(тарли, _, _, [сэмвел]).
семья(тирелл, оленна, _, [лорас, маргерри ]).
семья(мартелл, _, _, [оберин, элия]).


семья_факт(ланнистеры, платят_долги).

оружие(джейме, меч).
оружие(тайвин, меч).
оружие(нэд, меч).
оружие(арья, меч).
оружие(пёс, меч).
оружие(гора, меч).
оружие(бриена, меч).
оружие(роб, меч).
оружие(джон, меч).
оружие(кхал, аракх).
оружие(король_ночи, копьё).
оружие(мелисандра, магия).
оружие(бран, магия).
оружие(теон, меч).
оружие(рамси, псы).
оружие(рамси, меч).
оружие(рамси, лук).
оружие(оберин, яд).


% --- правила ---
 
% Элемент входит в список, если 
входит(X, [X | _ ]). % он является его головой, 
входит(X, [ _ | Список]) :-	входит(X, Список). % либо входит в хвост списка

% объединить(список1, список2, результат)
объединить([], L, L).
объединить([X | L1], L2, [X | L]) :- % первым элементом объединения является
                                     % первый элемент первого списка
объединить(L1, L2, L). % объединить хвост первого списка со вторым списком

удаление_дубликатов([], []) :- !.
удаление_дубликатов([H1|T1], Res) :- входит(H1, T1), !, удаление_дубликатов(T1, Res).
удаление_дубликатов([H1|T1], [H1|T2]) :- удаление_дубликатов(T1, T2).

получение_фактов(Результат) :- findall(Факт, персонаж(_, Факт), Список2), удаление_дубликатов(Список2, Результат).

печать([], _).
печать([Голова|Хвост], Индекс) :- write(Индекс), write('. '),
								  write(Голова), write('\n'), Индекс2 is Индекс + 1, печать(Хвост, Индекс2).

факты :- получение_фактов(Список), печать(Список, 1).